# Способ №1 написать программу:
def Делитель(a, step, k=''):
    k = k + f'{a}'
    if step == 5:
        print(k)
        return None
    if a % 2 == 0:
        Делитель(a // 2, step + 1, k + f'[1]->')
        Делитель(a + 1, step + 1, k + f'[2]->')
    else:
        Делитель(a + 1, step + 1, k + f'[2]->')


Делитель(89, 0)



