# Способ №1 написать программу:
def Квадратор (a, step, k=''):
    k = k + f'{a}'
    if step == 5 or a > 128: # (or a > 128 прерывает заведомо ошибочные ветки)
        print(k)
        return None
    if a - 4 > 0:
        Квадратор (a ** 2, step + 1, k + f'[1]->')
        Квадратор (a -4 , step + 1, k + f'[2]->')
    else:
        Квадратор (a ** 2, step + 1, k + f'[1]->')


Квадратор (2, 0)



